Revit 2026 API

# ScheduleFieldMultipleValuesDisplayType Enumeration

---

Define how the schedule field's multiple value is displayed.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ScheduleFieldMultipleValuesDisplayType
```
```vb
Public Enumeration ScheduleFieldMultipleValuesDisplayType
```
```cpp
public enum class ScheduleFieldMultipleValuesDisplayType
```
```fsharp
type ScheduleFieldMultipleValuesDisplayType
```

| Member name | Value | Description |
| --- | --- | --- |
| Custom | 2 | Display custom text per [!:Autodesk::Revit::DB::ScheduleField] instance, as defined by the [!:Autodesk::Revit::DB::ScheduleField::MultipleValuesCustomText] property. |
| Project | 0 | Display the project setting [!:Autodesk::Revit::DB::MultipleValuesIndicationSettings::Value]. |
| Varies | 1 | Display a standard hardcoded text, translated for the active locale. |

#### Reference

Autodesk.Revit.DB Namespace